app/controllers/api/ollama_models_controller.rb

SELECT `ollama_job_responses`.* FROM `ollama_job_responses` WHERE `ollama_job_responses`.`job_id` = '7db08389-4738-4ecb-be52-ce9e1f70233c' LIMIT 1
---
    def job_status
      job_id = params[:job_id]
      job_response = OllamaJobResponse.find_by(job_id: job_id)