app/jobs/ollama_query_job.rb

  def perform(prompt, job_id)
    begin
      # Query the model
      response = OllamaModelService.query(prompt)

      # Save the response to the database
      OllamaJobResponse.create!(
        job_id: job_id,
        prompt: prompt,
        state: 'done',
        data: response
      )
    rescue StandardError => e
      # Save the error to the database
      OllamaJobResponse.create!(
        job_id: job_id,
        prompt: prompt,
        state: 'error',
        error: e.message
      )
---
INSERT INTO `ollama_job_responses` (`job_id`, `prompt`, `state`, `data`, `error`, `created_at`, `updated_at`) VALUES ('61da6d88-3495-4462-a1a4-46bb6f689a69', 'hi', 'done', '<think>\n\n</think>\n\nHello! How can I assist you today? 😊', NULL, '2025-04-09 12:09:49.576495', '2025-04-09 12:09:49.576495')
INSERT INTO `ollama_job_responses` (`job_id`, `prompt`, `state`, `data`, `error`, `created_at`, `updated_at`) VALUES ('0622714d-02a5-4865-9b2a-af4a41d850a2', 'hw', 'error', NULL, 'Failed to open TCP connection to 127.0.0.11:11434 (Connection refused - connect(2) for \"127.0.0.11\" port 11434)', '2025-04-09 13:58:19.756147', '2025-04-09 13:58:19.756147')